package dataStructures;

import java.util.ArrayList;
import java.util.List;

/**
 * Задача №2: Очередь в банк (Со звёздочкой)
 * В отделении банка работает K окон, в общей очереди стоит N человек, каждому из которых понадобится
 * 10 минут на обслуживание. Вывести всех посетителей, кто подойдет к окнам через M минут от начала смены.
 *
 * Пример:
 *
 * Очередь N {Миша, Петя, Катя, Игорь}
 *
 * Окно K = 2
 *
 * M = 15 минут
 *
 * Ответ: на 15 минуте у окон будут стоять Катя и Игорь
 */

public class Task2 {
    public static void main(String[] args) {
    }}
