/**
 * Задача №4: Диапазоны значений (Со звёздочкой)
 * Выведите на экран диапазоны значений каждого из целочисленных примитивных типов.
 */

public class Task4 {
    public static void main(String[] args) {
        System.out.println("byte: от " + Byte.MIN_VALUE + " до " + Byte.MAX_VALUE);
        System.out.println("short: от " + Short.MIN_VALUE + " до " + Short.MAX_VALUE);
        System.out.println("int: от " + Integer.MIN_VALUE + " до " + Integer.MAX_VALUE);
        System.out.println("long: от " + Long.MIN_VALUE + " до " + Long.MAX_VALUE);
    }
}
