package helloworld;

/**
 * Задача №1: Мы обязательно изучим Java (База)
 * Напиши программу, которая выводит на экран надпись: "Мы обязательно изучим Java".
 */

public class Task1 {
    public static void main(String[] args) {
        System.out.println("Мы обязательно изучим Java");
    }

}
